---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..Close Method
Document Class See Also Send Feedback
---

Closes the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Close()()()() | Closes the document, save the changes if there are. |
|  | Close(Boolean) | Closes the document with the option to save. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace